<?php
////////task 5///////
// Декларирайте функция, която преброява колко пъти дадено число се появява в даден
// масив. Ако числото не е елемент на масива, функцията трябва да връща съответния
// отговор.

function ff($c){
$a=array(4,15,27,33,1);
	$br=0; //брой пъти
	for ($i=0; $i <count($a) ; $i++) { 
		if ($a[$i]==$c) {
			$br++; //увеличаваме броя с единица акосе срещне търсеното число
		}
}
if ($br==0) {
	echo "not in array";
}
else{
	echo "Числото ".$c. "се среща" .$br. "пъти в този масив";
}
}
$c=4; //числото, което търсим

ff($c);  //извикване на функцията